### What is MySQL?

MySQL is a relational database management system (RDBMS) developed by Oracle that is based on Structured Query Language (SQL).

### What is database?

A database is an organized collection of structured information or data.

### What is DBMS?

Database Management Systems (DBMS) are software systems used to store, retrieve and run queries on data.  
Examples of some Queries are:
- C: Create
- R: Read
- U: Update
- D: Delete

### Types of DBMS?

<b>Relational (SQL):</b>
- A relational database is a collection of data items with pre-defined relationships between them, stored in the form of table, rows and columns.
- List of SQL databases:
    - MySQL
    - MariaDB
    - Oracle
    - PostgreSQL
    - MSSQL
    

<br>

<b>Non-Relational (No-SQL):</b>  
- A non-relational database is a type of database management system that does not use the traditional table-based relational model of SQL databases. 
- Instead, it uses different data models to organize and store data and is designed to handle large volumes of unstructured or semi-structured data in big data and real-time web applications. 
- They are highly scalable, flexible, and easily modifiable.
- List of NoSQL databases:
    - MongoDB
    - Cassandra
    - Redis
    - Amazon DynamoDB
    - Apache HBase

### What is a database table?

Database table is a collection of rows and columns that contains relational data.

### What is WHERE clause?

The WHERE clause is used to filter records.  
It is used to extract those records that fulfill a specified condition.  
Conditions that can be used in WHERE clause are:  
- equals to: =
- not equals to: !=
- greater than: >
- smaller than: <
- greater than or equals to: >=
- smaller than or equals to: <=

### Alter Clause

- Alter is used to bring chances to the table.
- Used to:
    - add column in a table
    - change datatype of a column
    - change column name
    - add constraints to a column
    - delete column
    - renaming table

### Constraints in MySQL

Constraints in DBMS are the restrictions that are applied to data or operations on the data.  
This means that constraints allow only a particular kind of data to be inserted in the database or only some particular kind of operations to be performed on the data in the database.  
Constraints are used to validate the data.  
Some contraints in MySQL are:  
- NOT NULL
- UNIQUE
- DEFAULT
- CHECK
- FOREIGN KEY
- PRIMARY KEY

### Operators in MySQL

In SQL, operators are used to perform different types of operations on data and to compare values. Here are the main types of operators in SQL:  

<b>Arithmetic Operators:</b>   
- used to perform mathematical calculations on numerical values.
   - Addition (+)
   - Subtraction (-)
   - Multiplication (*)
   - Division (/)
   - Modulo (%)

<b>Comparison Operators:</b>    
- used to compare values in a SQL statement.
   - Equal to (=)
   - Not equal to (<> or !=)
   - Greater than (>)
   - Less than (<)
   - Greater than or equal to (>=)
   - Less than or equal to (<=)

<b>Logical Operators:</b>    
- used to combine multiple conditions in a SQL statement.
   - AND
   - OR
   - NOT

<b>Bitwise Operators:</b>    
- used to perform operations on binary values.
   - Bitwise AND (&)
   - Bitwise OR (|)
   - Bitwise XOR (^)
   - Bitwise NOT (~)

<b>Assignment Operators:</b>    
- used to assign a value to a variable or column in a SQL statement.
   - Equals (=)
   - Plus equals (+=)
   - Minus equals (-=)
   - Multiply equals (*=)
   - Divide equals (/=)


<br>

<b>Other Comparision Operators:</b>  
<u>IN operator:</u>
- IN operator allows you to specify multiple values in a WHERE clause.
- IN operator is a shorthand for multiple OR conditions.

<u>LIKE operator:</u>  
- LIKE operator is used in a WHERE clause to search for a specified pattern in a column.
- The percent sign (%) represents zero, one or multiple characters.
- The underscore sign (_) represents one, single character.  
% and _ are called wildcards.
<img src='assets/LIKE operator table.png' width=500>

## Clauses in SQL

A clause in SQL is a built-in function that helps to fetch the required records from a database table. A clause receives a conditional expression, i.e. a column name or some terms involving the columns.  

<b>SELECT:</b> 
- used to select data from one or more tables    
   
<b>FROM:</b> 
- used to specify the table or tables from which data will be selected  

<b>WHERE:</b> 
- used to filter data based on a specific condition  

<b>GROUP BY:</b> 
- used to group rows based on a specific column or set of columns  

<b>HAVING:</b> 
- used to filter data based on a specific condition after grouping  

<b>ORDER BY:</b> 
- used to sort the result set in ascending or descending order based on a  specific column or set of columns  

<b>LIMIT:</b> 
- used to limit the number of rows returned by the query  

<b>OFFSET:</b> 
- used to specify the starting point for returning rows in a query with LIMIT  

<b>JOIN:</b> 
- used to combine rows from two or more tables based on a related column between them  

<b>UNION:</b> 
- used to combine the result set of two or more SELECT statements into a single result set  

<b>INSERT INTO:</b> 
- used to insert new data into a table  

<b>UPDATE:</b> 
- used to update existing data in a table  

<b>DELETE FROM:</b> 
- used to delete data from a table  

<b>CREATE TABLE:</b> 
- used to create a new table  

<b>ALTER TABLE:</b>   
- used to modify the structure of an existing table  

<b>DROP TABLE:</b>   
- used to delete a table from the database.

### Aggregate Functions

- COUNT() : Returns the number of rows in a database table.
- SUM()   : Returns the total sum of a numeric column.
- AVG()   : Calculates the average of a set of values.
- MIN()   : Returns the lowest value in a set of non-null values.
- MAX()   : Returns the greatest value in a set of non-null values.

### Data Transaction

- Commit is used to save the changes in the database permanently.
- Commit can be used after the CUD operations.
- Rollback is used to revert back the database to the last Commit.

### Keys

<b>Primary Key:</b>
- Primary key always contains unique data.
- It cannot be null.
- There must be a single primary key.  

<b>Foreign Key:</b>  
- The foreign key is used to link two tables.
- A foreign key in one table (child table) is used to point Primary Key in another table (parent table).

### Data Types

There are primarily 3 data types in SQL:
- String Data Types:
    - CHAR(size) : 0 to 255
    - VARCHAR(size) : 0 to 65535
    - BINARY(size)
    - VARBINARY(size)
    - TINYTEXT : 255 characters
    - TEXT(size) : 65,535 bytes
    - MEDIUMTEXT : 16,777,215 characters
    - LONGTEXT : 4,294,967,295 characters
    - TINYBLOB : 255 bytes
    - BLOB(size) : 65,535 bytes
    - MEDIUMBLOB : 16,777,215 bytes
    - LONGBLOB : 4,294,967,295 bytes
    - ENUM(val1, val2, val3, ...) : list upto 65535 values
    - SET(val1, val2, val3, ...) : list upto 64 values

<br>

- Numeric Data Type:
    - BIT(size) : 1 to 64
    - TINYINT(size) : -128 to 127
    - INT(size) : -2147483648 to 2147483647
    - INTEGER(size)
    - SMALLINT(size) : -32768 to 32767
    - MEDIUMINT(size) : -8388608 to 8388607
    - BIGINT(size) : -9223342036854775808 to 9223342036854775807
    - BOOL
    - BOOLEAN: 0/1
    - FLOAT(p)
    - DOUBLE(size, d) : 255.568
    - DECIMAL(size, d): size=60, d=30
    - DEC(size, d)
    
<br>

- Date & Time Data Type:
    - DATE : '1000-01-01' to '9999-12-31'
    - DATETIME(fsp) : YYYY-MM-DD hh:mm:ss
    - TIMESTAMP(fsp)
    - TIME(fsp) : hh:mm:ss
    - YEAR : YYYY

## <center>Code and Syntax:</center>

### `INITIALIZE DATABASE & TABLE:`


<b>Create a new database</b>  
CREATE DATABASE db_name;

<b>Select a database:</b>  
USE db_name;

<b>Create a new table inside the selected database:</b>  
CREATE TABLE table_name(  
    column1 datatype,   
    column2 datatype,  
    column3 datatype,  
    ...  
);

### `INSERT QUERY:`

<b>Insert single row into the table:</b>  
INSERT INTO table_name   
(col1, col2, col3, ...)  
VALUES   
(val1, val2, val3, ...);

<b>Insert multiple rows into the table:</b>  
INSERT INTO table_name  
(col1, col2, col3, ...)  
VALUES  
(val1, val2, val3, ...),  
(val1, val2, val3, ...),  
(val1, val2, val3, ...);  

<b>Insert rows without mentioning the column names:</b> (NOTE: the values must correspond to columns)  
INSERT INTO table_name VALUES    
(val1, val2, val3, ...),  
(val1, val2, val3, ...),  
(val1, val2, val3, ...);

### `SELECT QUERY:`

<b>Select some columns:</b>  
SELECT col1, col2, col3, ...  
FROM table_name;  

<b>Select column name and display them with an alias:</b>  
SELECT col1, col2 AS "alias_name", col3, ...  
FROM table_name;  

<b>Select all columns:</b>  
SELECT * FROM table_name;

<b>Select columns using WHERE clause:</b>  
SELECT col1, col2, ...  
FROM table_name  
WHERE condition;

### `ALETR QUERY:`

<b>Add column:</b>  
ALTER TABLE table_name  
ADD column_name data_type;  

<b>Modify column:</b>  
ALTER TABLE table_name  
MODIFY column_name data_type;

<b>Delete column:</b>  
ALTER TABLE table_name  
DROP COLUMN column_name data_type;

<b>Rename column:</b>  
ALTER TABLE table_name  
CHANGE column_name new_column_name data_type;

<b>Rename table:</b>  
ALTER TABLE table_name  
RENAME new_table_name;

### `OPERATORS:`

<b>AND, OR & NOT operators:</b>  
SELECT * FROM table_name  
WHERE condn1 AND (condn2 OR NOT condn3);  

<b>IN operator:</b>  
SELECT * FROM table_name  
WHERE col_name IN  
(val1, val2, val3...);

<b>LIKE operator:</b>  
SELECT * FROM table_name  
WHERE col_name LIKE 'x%';

### `Data with Between & Not Between:`

NOTE: only applicable with numeric data   

<b>Select rows which have col value between val1 and val2</b>  
SELECT * FROM table_name    
WHERE col_name BETWEEN val1 AND val2;  

<b>Select rows which donot have col value between val1 and val2</b>  
SELECT * FROM table_name  
WHERE col_name NOT BETWEEN val1 AND val2;

### `Order by & Distinct Clauses:`

<b>Order table in ascending or descending order:</b>  
SELECT * FROM table_name  
ORDER BY col_name ASC|DESC;  

<b>Extract only Distinct (Unique) data:</b>  
SELECT DISTINCT col_name  
FROM table_name;

### `Is Null & Is Not Null Operators:`

<b>Extract row in which col_name is empty:</b>  
SELECT * FROM table_name  
WHERE col_name IS NULL;  

<b>Extract row in which col_name is not empty:</b>  
SELECT * FROM table_name  
WHERE col_name IS NOT NULL;

### `Limit & Offset Operators:`

<b>Limit the no of data returned from the table:</b>  
SELECT * FROM table_name  
LIMIT no_to_limit_by;

<b>Using OFFSET to specify from where to start returning the data:</b>  
SELECT * FROM table_name  
LIMIT no_to_limit_by OFFSET no_of_rows_to_skip;

### `Aggregate Functions:`

<b>Count the no of rows in a database:</b>  
SELECT count(col_name) FROM table_name;  

<b>Get the sum of rows in a database:</b>  
SELECT sum(col_name) FROM table_name;  

<b>Get the max value of rows in a database:</b>  
SELECT max(col_name) FROM table_name;  

<b>Get the min value of rows in a database:</b>  
SELECT min(col_name) FROM table_name;  

<b>Get the average(median) value of rows in a database:</b>    
SELECT avg(col_name) FROM table_name;

### `Update & Delete Queries:`

<b>Update Query:</b>  
UPDATE table_name  
SET col_name1 = new-value1,  
col_name = new-value2  
[WHERE CLAUSE];


<b>Delete Query:</b>  
DELETE FROM table_name  
[WHERE CLAUSE];

### `Data Transaction`

<b>Commit:</b>  
COMMIT;  


- CREATE
- DELETE
- UPDATE

<b>Rollback:</b>  
ROLLBACK;

### `Keys`

<b>Primary Key:</b>  
CREATE TABLE table_name (  
  id INT NOT NULL AUTO_INCREMENT,  
  name VARCHAR(50) NOT NULL,  
  age INT NOT NULL,  
  city VARCHAR(50) NOT NULL,  
  
  PRIMARY KEY (id)  
);  

<b>Foreign Key:</b>  
CREATE TABLE table_name (  
  id INT NOT NULL AUTO_INCREMENT,  
  name VARCHAR(50) NOT NULL,  
  age INT NOT NULL,  
  city INT NOT NULL,    
  
  PRIMARY KEY (id),  
  FOREIGN KEY (city) REFERENCES city (id)  
);